''' 
分類
資料:程式的基本單位

1.數字分為:
346   整數
      長整數(很大的數字)
3.5   浮點數(小數)

2.字串 
"   " 雙引號內可寫任意文字
"Hello World"
"你好"

3.布林值
True  #正確 
False #錯誤 

4.可變列表(List)  
[,,,] (有順序+可動列表)
[3,4,5]   #使用中括號
["Hello","World"]

5.固定列表(Tuple)(有順序+不可動列表)
(,,,)    使用小括號
(3,4,5)  
("Hello","World")

6.集合(set)(排列無順序性)
{,,,}    使用大括號
{3,4,5}   
{"Hello World"}

7.字典(Dictionary)-資料查詢(Key-Value Pair)(a-z)
{"apple"(件):"蘋果"(值),"data":"資料",,,}

8.變數variable(用來儲存資料的自訂名稱)開頭要英文  
     變數名稱=資料
x=3

9.print(資料) 
print(x)    得出3(因為x=3，所以列印x會得到資料3)

x=True      將x從1取代成True
     print(x)    得出True

x={3,4,5}   將x從True取代成{3,4,5}
     print(x)    得出{3,4,5}

'''
